In [3]:
import pandas as pd
from google.colab import files

In [4]:
uploaded  = files.upload()

Saving student_result2 .csv to student_result2 .csv

In [5]:
df = pd.read_csv('student_result2 .csv')
df

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
3        1004      NaN            7          6          60   NaN
4        1005     11.0            8          7          45   Yes

#remove rows with missing values

In [6]:
df.dropna()

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes

In [7]:
#remove column with missing value
df.dropna( axis=1)

   Student Id  \tstudy hrs  \tslp hrs  social mda
0        1001            2          6          50
1        1002            5          7          80
2        1003            6          5          70
3        1004            7          6          60
4        1005            8          7          45

In [8]:
df.dropna(how='any')
#drop all rows with Nan values

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes

In [9]:
df.dropna(axis=1,how='any')

   Student Id  \tstudy hrs  \tslp hrs  social mda
0        1001            2          6          50
1        1002            5          7          80
2        1003            6          5          70
3        1004            7          6          60
4        1005            8          7          45

In [10]:
#howw =all hole jodi kono column e all value nan hoy
# t sei column k drop korbebut single value thakle korbena remove
df.dropna(how='all')

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
3        1004      NaN            7          6          60   NaN
4        1005     11.0            8          7          45   Yes

In [11]:
#return rows which contain at least one not null values
df.dropna(thresh=1)

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
3        1004      NaN            7          6          60   NaN
4        1005     11.0            8          7          45   Yes

In [13]:
df.dropna(thresh=5)

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes

In [14]:
df.dropna(subset=['Student Id'])

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
3        1004      NaN            7          6          60   NaN
4        1005     11.0            8          7          45   Yes

In [16]:
#delete the row which contain nan value in this specific columns
df.dropna(subset=['\tclass'])

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes

#inplace: if true-> update the dataframe and drop nan values
#false->create new new dataframe

In [18]:
df.dropna(inplace=True)
df

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes

In [19]:
df.dropna(inplace=False)

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001     10.0            2          6          50   Yes
1        1002     10.0            5          7          80    No
2        1003     10.0            6          5          70   Yes
4        1005     11.0            8          7          45   Yes